Feature: Авторизация
  @api @smoke
  Scenario: Успешный вход
    Given Создаем запрос на авторизацию для "ADMIN"
    When Отправляем запрос
    Then Проверка статуса ответа 200
    And Проверку полей в ответе

  @api @smoke
  Scenario: Получение информации о текущем пользователе
    Given Создаем запрос на авторизацию для "ADMIN"
    When Запрос информации о текущем пользователе 1
    Then Проверяем почту пользователя

  @api
  Scenario: Доступ без токена
    Given Создаем запрос на авторизацию для "ADMIN"
    When Запрос информации о текущем пользователе 0
    Then Проверка статуса ответа 401