Feature: Работа с задачами

  @api
  Scenario: Полный жизненный цикл задачи в проекте DEMO
    Given Поиск проекта DEMO
    And Генерация уникального заголовка

    When Создадим новую задачу в проекте
    Then В результате статус ответа 201, статус задачи TODO, версия 0

    When Получаем созданную задачу
    Then В результате заголовки совпадают

    When Переводим статус в IN_PROGRESS
    Then В результате статус ответа 200, статус задачи IN_PROGRESS, версия 1

    When Удаляем созданную задачу
    Then В результате статус 204

    When Получаем созданную задачу
    Then В результате статус 404
